app/Controllers/Book.php

    public function index()
    {
        if(!session('id'))
        {
            return redirect()->to(base_url())->with('error', 'Anda harus Login');
        }

        $data = array(
            'book' => $this->bookmodel
                            ->select('book.id as id,book.title,book.author,book.publication_year,publisher.name,category.category,book.quantity')
                            ->join('publisher', 'book.id_publisher=publisher.id','left')
                            ->join('category', 'book.id_category=category.id','left')
                            ->findAll(),
        );
---
SELECT `book`.`id` as `id`, `book`.`title`, `book`.`author`, `book`.`publication_year`, `publisher`.`name`, `category`.`category`, `book`.`quantity`
FROM `book`
LEFT JOIN `publisher` ON `book`.`id_publisher`=`publisher`.`id`
LEFT JOIN `category` ON `book`.`id_category`=`category`.`id`
WHERE `book`.`deleted_at` IS NULL

    public function add()
    {
        if(!session('id'))
        {
            return redirect()->to(base_url())->with('error', 'Anda harus login');
        }

        $data = array(
            'publisher' => $this->publishermodel->findAll(),
            'category' => $this->categorymodel->findAll(),
        );
---
SELECT *
FROM `publisher`
WHERE `publisher`.`deleted_at` IS NULL
SELECT *
FROM `category`
WHERE `category`.`deleted_at` IS NULL

            return redirect()->to('book-add')->withInput();
        }

            $this->bookmodel->save([
                'title' => $post['title'],
                'author' => $post['author'],
                'publication_year' => $post['publication_year'],
                'id_publisher' => $post['id_publisher'],
                'id_category' => $post['id_category'],
                'quantity' => $post['quantity'],
            ]);
---
INSERT INTO `book` (`title`, `author`, `publication_year`, `id_publisher`, `id_category`, `quantity`, `created_at`, `updated_at`) VALUES ('kejuruan', 'ahmad fuadia', '22', '1', '2', '24', '2023-05-19 12:33:49', '2023-05-19 12:33:49')

    public function edit($id)
    {
        if(!session('id'))
        {
            return redirect()->to(base_url())->with('error','Anda Harus Login');
        }

        $data = array(
            'item' => $this->bookmodel->where(['id' => $id])->first(),
            'id' => $id,
            'publisher' => $this->publishermodel->findAll(),
            'category' => $this->categorymodel->findAll(),

        );
---
SELECT *
FROM `book`
WHERE `id` = '9'
AND `book`.`deleted_at` IS NULL
 LIMIT 1
SELECT *
FROM `publisher`
WHERE `publisher`.`deleted_at` IS NULL
SELECT *
FROM `category`
WHERE `category`.`deleted_at` IS NULL

                session()->setFlashdata('validation',$validation->getErrors());
                return redirect()->to('book-edit/'.$post['id'])->withInput();
            }
            $this->bookmodel->save([
                'id'    => $post['id'],
                'title' => $post['title'],
                'author' => $post['author'],
                'publication_year' => $post['publication_year'],
                'id_publisher' => $post['id_publisher'],
                'id_category' => $post['id_category'],
                'quantity' => $post['quantity'],
            ]);
---
UPDATE `book` SET `title` = 'Novel', `author` = 'ahmad', `publication_year` = '23', `id_publisher` = '1', `id_category` = '2', `quantity` = '12', `updated_at` = '2023-05-19 12:32:52'
WHERE `book`.`id` IN ('3')