app/Controllers/Borrow.php

SELECT *
FROM `borrower`
WHERE `borrower`.`deleted_at` IS NULL
SELECT *
FROM `book`
WHERE `book`.`deleted_at` IS NULL
SELECT *
FROM `staff`
WHERE `staff`.`deleted_at` IS NULL
---
    public function add()
    {
        if (!session('id')) {
            return redirect()->to(base_url())->with('error', 'Anda harus login');
        }

        $data = array(
            'borrower' => $this->borrowerModel->findAll(),
            'book' => $this->bookModel->findAll(),
            'staff' => $this->staffModel->findAll(),
        );

INSERT INTO `borrow` (`id_borrower`, `id_book`, `id_staff`, `release_date`, `due_date`, `note`, `created_at`, `updated_at`) VALUES ('3', '9', '2', '2023-05-25', '2023-05-24', 'pinjam bawa pulang', '2023-05-17 11:28:30', '2023-05-17 11:28:30')
---
            return redirect()->to('borrow-add')->withInput();
        }

        $this->borrowModel->save([
            'id_borrower' => $post['id_borrower'],
            'id_book' => $post['id_book'],
            'id_staff' => $post['id_staff'],
            'release_date' => $post['release_date'],
            'due_date' => $post['due_date'],
            'note' => $post['note'],
        ]);