app/Controllers/Borrower.php

    public function index()
    {
        if(!session('id'))
        {
            return redirect()->to(base_url())->with('error', 'Anda Harus Login');
        }
        $data = array(
            'borrower' => $this->borrowermodel->findAll(),
        );
---
SELECT *
FROM `borrower`
WHERE `borrower`.`deleted_at` IS NULL

            session()->setFlashdata('validation',$validation->getErrors());
            return redirect()->to('borrower-add')->withInput();
        }
            $this->borrowermodel->save([
                'name' => $post['name'],
                'birthdate' => $post['birthdate'],
                'address' => $post['address'],
                'gender' => $post['gender'],
                'contact' => $post['contact'],
                'email' => $post['email']
            ]);
---
INSERT INTO `borrower` (`name`, `birthdate`, `address`, `gender`, `contact`, `email`, `created_at`, `updated_at`) VALUES ('ally', '2023-05-12', '2023-05-12', 'L', '123243433465', 'agi@gmail.com', '2023-05-15 12:55:34', '2023-05-15 12:55:34')

    public function edit($id)
    {
        if(!session('id'))
        {
            return redirect()->to(base_url())->with('error','Anda Harus Login');
        }
        $data = array(
            'item' => $this->borrowermodel->where(['id'=>$id])->first(),
            'id' => $id,
        );
---
SELECT *
FROM `borrower`
WHERE `id` = '2'
AND `borrower`.`deleted_at` IS NULL
 LIMIT 1

    public function del($id)
    {
        if(!session('id'))
        {
            return redirect()->to(base_url())->with('error','Anda Harus Login');
        }

        $delete = $this->borrowermodel->delete($id);
---
UPDATE `borrower` SET `deleted_at` = '2023-05-15 12:56:12', `updated_at` = '2023-05-15 12:56:12'
WHERE `id` IN ('2')
AND `deleted_at` IS NULL