app/Controllers/Category.php

SELECT *
FROM `category`
WHERE `category`.`deleted_at` IS NULL
---
    public function index()
    {
        if(!session('id'))
        {
            return redirect()->to(base_url())->with('error', 'Anda Harus Login');
        }
        $data = array(
            'category' => $this->categorymodel->findAll(),
        );

SELECT *
FROM `category`
WHERE `id` = '3'
AND `category`.`deleted_at` IS NULL
 LIMIT 1
---
    public function edit($id)
    {
        if(!session('id'))
        {
            return redirect()->to(base_url())->with('error','Anda Harus Login');
        }
        $data = array(
            'item' => $this->categorymodel->where(['id'=>$id])->first(),
            'id' => $id,
        );