app/Controllers/Publisher.php

SELECT *
FROM `publisher`
WHERE `publisher`.`deleted_at` IS NULL
---
    public function index()
    {
        if(!session('id'))
        {
            return redirect()->to(base_url())->with('error', 'Anda Harus Login');
        }
        $data = array(
            'publisher' => $this->publishermodel->findAll(),
        );

SELECT *
FROM `publisher`
WHERE `id` = '1'
AND `publisher`.`deleted_at` IS NULL
 LIMIT 1
---
    public function edit($id)
    {
        if(!session('id'))
        {
            return redirect()->to(base_url())->with('error','Anda Harus Login');
        }
        $data = array(
            'item' => $this->publishermodel->where(['id'=>$id])->first(),
            'id' => $id,
        );

SELECT *
FROM `publisher`
WHERE `id` = '1'
AND `publisher`.`deleted_at` IS NULL
 LIMIT 1
---
    public function editpro()
    {
        if(!session('id'))
        {
            return redirect()->to(base_url())->with('error','Anda Harus Login');
        }

        $post = $this->request->getPost();
        $datapost = $this->publishermodel->where(['id' => $post['id']])->first();

UPDATE `publisher` SET `name` = 'bandung raya', `address` = 'Bandung barat', `contact` = '09876545755', `updated_at` = '2023-05-16 12:26:26'
WHERE `publisher`.`id` IN ('1')
---
                session()->setFlashdata('validation',$validation->getErrors());
                return redirect()->to('publisher-edit/'.$post['id'])->withInput();
            }
            $this->publishermodel->save([
                'id'    => $post['id'],
                'name' => $post['name'],
                'address' => $post['address'],
                'contact' => $post['contact'],
            ]);