app/Controllers/Staff.php

    public function index()
    {
        if(!session('id'))
        {
            return redirect()->to(base_url())->with('error', 'Anda Harus Login');
        }
        $data = array(
            'staff' => $this->staffmodel->findAll(),
        );
---
SELECT *
FROM `staff`
WHERE `staff`.`deleted_at` IS NULL

            session()->setFlashdata('validation',$validation->getErrors());
            return redirect()->to('staff-add')->withInput();
        }
            $this->staffmodel->save([
                'name' => $post['name'],
                'email' => $post['email'],
                'password' => md5($post['password']),
            ]);
---
INSERT INTO `staff` (`name`, `email`, `password`, `created_at`, `updated_at`) VALUES ('ally', 'ah@asg', 'b472ff6dc2dd3dc016fab1d7bf41e0eb', '2023-05-12 11:27:52', '2023-05-12 11:27:52')